In [44]:
import numpy as np
import pandas as pd

In [45]:
#Let's create a DataFrame
d = {'A':[1,1,np.nan,5],'B':[np.nan,2,3,4],'C':[1,2,3,np.nan]}

In [46]:
df = pd.DataFrame(d)

In [47]:
df

     A    B    C
0  1.0  NaN  1.0
1  1.0  2.0  2.0
2  NaN  3.0  3.0
3  5.0  4.0  NaN

In [48]:
#This will drop all the rows containing null values
df.dropna()

     A    B    C
1  1.0  2.0  2.0

In [49]:
#This will drop all the columns containing null values 
df.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [50]:
#Will only drop columns with minimum 2 NaN values
df.dropna(thresh=2)

     A    B    C
0  1.0  NaN  1.0
1  1.0  2.0  2.0
2  NaN  3.0  3.0
3  5.0  4.0  NaN

In [51]:
#We won't drop missing values everytime we have to fill in missing values to make our data consistent 
#Here are some methods to fill missing values

In [52]:
df

     A    B    C
0  1.0  NaN  1.0
1  1.0  2.0  2.0
2  NaN  3.0  3.0
3  5.0  4.0  NaN

In [53]:
#Replace the missing values by mean 
df['B']=df['B'].fillna(df['B'].mean())

In [54]:
df

     A    B    C
0  1.0  3.0  1.0
1  1.0  2.0  2.0
2  NaN  3.0  3.0
3  5.0  4.0  NaN

In [55]:
#Replace the missing values by mode 
df['A'].mode()

0    1.0
dtype: float64

In [56]:
df['A']=df['A'].fillna(df['A'].mode()[0])

In [57]:
df

     A    B    C
0  1.0  3.0  1.0
1  1.0  2.0  2.0
2  1.0  3.0  3.0
3  5.0  4.0  NaN

In [58]:
df

     A    B    C
0  1.0  3.0  1.0
1  1.0  2.0  2.0
2  1.0  3.0  3.0
3  5.0  4.0  NaN

In [59]:
df['C'] = df['C'].fillna(df['C'].median())

In [60]:
df

     A    B    C
0  1.0  3.0  1.0
1  1.0  2.0  2.0
2  1.0  3.0  3.0
3  5.0  4.0  2.0